In [2]:
import pandas as pd

Series

In [3]:
# 1. Creating a series
import pandas as pd
import numpy as np


# Creating empty series
ser = pd.Series()

print(ser)

# simple array
data = np.array(['t', 'e', 'c', 'k', 'i'])
	
ser = pd.Series(data)
print(ser)

C:\Users\RAMAN SINGH\anaconda3\lib\site-packages\ipykernel_launcher.py:7: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  import sys

Series([], dtype: float64)
0    t
1    e
2    c
3    k
4    i
dtype: object

Dataframe

In [5]:
# 1.  
# list of strings
lst = ['hell', 'is', 'for', 'the', 
            'devil', 'to', 'rule']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

       0
0   hell
1     is
2    for
3    the
4  devil
5     to
6   rule

Pannel

Create a pandas dataframe

In [ ]:
# 1. From a python objects

In [6]:
# 1.1  creating empty dataframe

# Calling DataFrame constructor
df = pd.DataFrame()

print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
# 1.2 Python code demonstrate creating DataFrame from dict narray / lists

# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}

# Create DataFrame
df = pd.DataFrame(data)

# Print the output.
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [9]:
# 2. from a file

# Python program to illustrate
# creating a data frame using CSV files

# creating a data frame
df = pd.read_csv("results.csv")
print(df.head())

         date                                        competition       team_1  \
0  19-11-2019  International - European Championship Qualific...      Germany
1  19-11-2019  International - European Championship Qualific...  Netherlands
2  19-11-2019  International - European Championship Qualific...     Slovakia
3  19-11-2019  International - European Championship Qualific...        Wales
4  19-11-2019  International - European Championship Qualific...    Macedonia

   team_1_score  team_2_score            team_2
0             6             1  Northern Ireland
1             5             0           Estonia
2             2             0        Azerbaijan
3             2             0           Hungary
4             1             0            Israel

In [ ]:
# 3. from a database

In [11]:
# Python code to demonstrate table creation and insertions with SQL

# importing module
import sqlite3

# connecting to the database
connection = sqlite3.connect("myTable.db")

# cursor
crsr = connection.cursor()

# SQL command to create a table in the database
sql_command = """CREATE TABLE emp (
staff_number INTEGER PRIMARY KEY,
fname VARCHAR(20),
lname VARCHAR(30),
gender CHAR(1),
joining DATE);"""

# execute the statement
crsr.execute(sql_command)

# SQL command to insert the data in the table
sql_command = """INSERT INTO emp VALUES (23, "Rishabh", "Bansal", "M", "2014-03-28");"""
crsr.execute(sql_command)

# another SQL command to insert the data in the table
sql_command = """INSERT INTO emp VALUES (1, "Bill", "Gates", "M", "1980-10-28");"""
crsr.execute(sql_command)

# To save the changes in the files. Never skip this.
# If we skip this, nothing will be saved in the database.
connection.commit()

# close the connection
connection.close()

In [12]:
# Python code to demonstrate SQL to fetch data.

# importing the module
import sqlite3

# connect withe the myTable database
connection = sqlite3.connect("myTable.db")

# cursor object
crsr = connection.cursor()

# execute the command to fetch all the data from the table emp
crsr.execute("SELECT * FROM emp")

# store all the fetched data in the ans variable
ans = crsr.fetchall()

# Since we have already selected all the data entries
# using the "SELECT *" SQL command and stored them in
# the ans variable, all we need to do now is to print
# out the ans variable
print(ans)

[(1, 'Bill', 'Gates', 'M', '1980-10-28'), (23, 'Rishabh', 'Bansal', 'M', '2014-03-28')]

In [13]:
# Read sqlite query results into a pandas DataFrame
con = sqlite3.connect("myTable.db")
df = pd.read_sql_query("SELECT * from emp", con)

# Verify that result of SQL query is stored in the dataframe
print(df.head())

con.close()

   staff_number    fname   lname gender     joining
0             1     Bill   Gates      M  1980-10-28
1            23  Rishabh  Bansal      M  2014-03-28

In [ ]:
# 4. from a API

In [16]:
!pip install requests

Requirement already satisfied: requests in c:\users\raman singh\anaconda3\lib\site-packages (2.23.0)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\users\raman singh\anaconda3\lib\site-packages (from requests) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\raman singh\anaconda3\lib\site-packages (from requests) (2020.4.5.1)
Requirement already satisfied: idna<3,>=2.5 in c:\users\raman singh\anaconda3\lib\site-packages (from requests) (2.9)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\raman singh\anaconda3\lib\site-packages (from requests) (1.25.8)

In [29]:
import requests
response = requests.get("http://api.open-notify.org/astros.json")
print(response)

<Response [200]>

In [31]:
x = response.json()
x

{'people': [{'name': 'Mark Vande Hei', 'craft': 'ISS'},
  {'name': 'Oleg Novitskiy', 'craft': 'ISS'},
  {'name': 'Pyotr Dubrov', 'craft': 'ISS'},
  {'name': 'Thomas Pesquet', 'craft': 'ISS'},
  {'name': 'Megan McArthur', 'craft': 'ISS'},
  {'name': 'Shane Kimbrough', 'craft': 'ISS'},
  {'name': 'Akihiko Hoshide', 'craft': 'ISS'},
  {'name': 'Nie Haisheng', 'craft': 'Tiangong'},
  {'name': 'Liu Boming', 'craft': 'Tiangong'},
  {'name': 'Tang Hongbo', 'craft': 'Tiangong'}],
 'number': 10,
 'message': 'success'}

In [32]:
df = pd.DataFrame(x)
df.head()

                                       people  number  message
0  {'name': 'Mark Vande Hei', 'craft': 'ISS'}      10  success
1  {'name': 'Oleg Novitskiy', 'craft': 'ISS'}      10  success
2    {'name': 'Pyotr Dubrov', 'craft': 'ISS'}      10  success
3  {'name': 'Thomas Pesquet', 'craft': 'ISS'}      10  success
4  {'name': 'Megan McArthur', 'craft': 'ISS'}      10  success

In [33]:
df = pd.read_json(json.dumps(x))
df

                                          people  number  message
0     {'name': 'Mark Vande Hei', 'craft': 'ISS'}      10  success
1     {'name': 'Oleg Novitskiy', 'craft': 'ISS'}      10  success
2       {'name': 'Pyotr Dubrov', 'craft': 'ISS'}      10  success
3     {'name': 'Thomas Pesquet', 'craft': 'ISS'}      10  success
4     {'name': 'Megan McArthur', 'craft': 'ISS'}      10  success
5    {'name': 'Shane Kimbrough', 'craft': 'ISS'}      10  success
6    {'name': 'Akihiko Hoshide', 'craft': 'ISS'}      10  success
7  {'name': 'Nie Haisheng', 'craft': 'Tiangong'}      10  success
8    {'name': 'Liu Boming', 'craft': 'Tiangong'}      10  success
9   {'name': 'Tang Hongbo', 'craft': 'Tiangong'}      10  success

In [34]:
data = pd.DataFrame(x['people'])
data

              name     craft
0   Mark Vande Hei       ISS
1   Oleg Novitskiy       ISS
2     Pyotr Dubrov       ISS
3   Thomas Pesquet       ISS
4   Megan McArthur       ISS
5  Shane Kimbrough       ISS
6  Akihiko Hoshide       ISS
7     Nie Haisheng  Tiangong
8       Liu Boming  Tiangong
9      Tang Hongbo  Tiangong

Examining and summarizing the data

In [36]:
# 1. shape of data
data.shape

(10, 2)

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   craft   10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [39]:
dfa = pd.read_csv("results.csv")
print(dfa.head())

         date                                        competition       team_1  \
0  19-11-2019  International - European Championship Qualific...      Germany
1  19-11-2019  International - European Championship Qualific...  Netherlands
2  19-11-2019  International - European Championship Qualific...     Slovakia
3  19-11-2019  International - European Championship Qualific...        Wales
4  19-11-2019  International - European Championship Qualific...    Macedonia

   team_1_score  team_2_score            team_2
0             6             1  Northern Ireland
1             5             0           Estonia
2             2             0        Azerbaijan
3             2             0           Hungary
4             1             0            Israel

In [40]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164 entries, 0 to 163
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          164 non-null    object
 1   competition   164 non-null    object
 2   team_1        164 non-null    object
 3   team_1_score  164 non-null    int64
 4   team_2_score  164 non-null    int64
 5   team_2        164 non-null    object
dtypes: int64(2), object(4)
memory usage: 7.8+ KB

In [41]:
dfa.describe()

       team_1_score  team_2_score
count    164.000000    164.000000
mean       1.810976      1.024390
std        1.878422      1.233237
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       10.000000      6.000000

In [43]:
# count the number of matches on a given date
dfa["date"].value_counts()

19-11-2019    44
14-11-2019    36
17-11-2019    25
15-11-2019    21
18-11-2019    20
16-11-2019    18
Name: date, dtype: int64

In [47]:
# which team played most home matches
dfa["team_1"].value_counts()

Brazil            2
Albania           2
Germany           2
San Marino        2
Croatia           2
                 ..
Aruba             1
Slovakia          1
Czech Republic    1
Zimbabwe          1
Rwanda            1
Name: team_1, Length: 139, dtype: int64